// src/assets/membershipData.ts

export interface MembershipStore {
  name: string;
  lat: number;
  lng: number;
  benefit: string;
}

export const membershipStores: MembershipStore[] = [
  { name: "GS25대연용소초교점", lat: 35.13988407, lng: 129.1035224, benefit: "도넛 무료 추가" },
  { name: "도미노피자용호 남천점", lat: 35.13865175, lng: 129.103392, benefit: "샌드위치 10% 할인" },
  { name: "파리바게뜨대연 혁신점", lat: 35.13856751, lng: 129.1009763, benefit: "학생 할인 5%" },
  { name: "GS25대연그린점", lat: 35.13822332, lng: 129.1010772, benefit: "아메리카노 300원 할인" },
  { name: "GS25예술관점경성대", lat: 35.13843841, lng: 129.1001064, benefit: "아메리카노 300원 할인" },
  { name: "뚜레쥬르부산대남점 ", lat: 35.14101451, lng: 129.1064039, benefit: "전 메뉴 10% 할인" },
  { name: "GS25S경성부경대역점", lat: 35.1375584, lng: 129.1004458, benefit: "전 메뉴 10% 할인" },
  { name: "GS더프레시부산 남천역점", lat: 35.14045742, lng: 129.1068284, benefit: "아메리카노 300원 할인" },
  { name: "반올림피자샵 부산남구점", lat: 35.13747865, lng: 129.1050402, benefit: "멤버십 회원 1천원 할인" },
  { name: "GS25남천더샵점", lat: 35.14235644, lng: 129.1064494, benefit: "오전 11시 전 방문 시 무료 추가샷" },
  { name: "GS25부경대연점", lat: 35.13676536, lng: 129.1035628, benefit: "아메리카노 300원 할인" },
  { name: "뚜레쥬르부경대점 경성대", lat: 35.13697869, lng: 129.1006174, benefit: "빵 1+1" },
  { name: "GS더프레시 경성부경대점", lat: 35.13649977, lng: 129.1022506, benefit: "디저트 10% 할인" },
  { name: "GS25부경대후문점", lat: 35.13778138, lng: 129.1062877, benefit: "전 메뉴 10% 할인" },
  { name: "GS25부경대후문점", lat: 35.13778138, lng: 129.1062877, benefit: "샌드위치 10% 할인" },
  { name: "할리스커미용산 경성대점", lat: 35.13667186, lng: 129.1006424, benefit: "디카페인 변경 무료" },
  { name: "CGV 대연점", lat: 35.13733667, lng: 129.0992617, benefit: "샌드위치 10% 할인" },
  { name: "배스킨라빈스 ", lat: 35.136554, lng: 129.1006832, benefit: "쿠키 무료" },
  { name: "할리스커미용산2호점 경성대", lat: 35.13692031, lng: 129.099826, benefit: "싱글킹 무료 업그레이드" },
  { name: "GS25남천파크점", lat: 35.14088333, lng: 129.107728, benefit: "아메리카노 300원 할인" },
  { name: "파리바게뜨 경성대점", lat: 35.13664514, lng: 129.1001042, benefit: "쿠키 1+1" },
  { name: "GS더프레시대연더비치점 ", lat: 35.1379936, lng: 129.1070391, benefit: "학생 할인 5%" },
  { name: "미스터피자 경성대점", lat: 35.13649893, lng: 129.1002211, benefit: "도넛 무료 추가" },
  { name: "배스킨라빈스31부산 남천점", lat: 35.14182397, lng: 129.1080484, benefit: "음료 무료 사이즈업" },
  { name: "GS25부경제일점", lat: 35.13566309, lng: 129.1026898, benefit: "커피 50% 할인" },
  { name: "GS25경성중앙점", lat: 35.13658251, lng: 129.0990385, benefit: "전 메뉴 10% 할인" },
  { name: "파리바게뜨부산 남천점", lat: 35.13909263, lng: 129.1086143, benefit: "커피 300원 할인" },
  { name: "GS25남천봉황점", lat: 35.14100789, lng: 129.110408, benefit: "싱글킹 무료 업그레이드" },
  { name: "유가네닭갈비 남천점", lat: 35.14291707, lng: 129.1099636, benefit: "에이드 무료 사이즈업" },
  { name: "GS25대연에이스점", lat: 35.13517576, lng: 129.0975324, benefit: "커피 50% 할인" },
];
